Amiya200/stm32_water_tank/Core/Src/screen.c
/***************************************************************
 *  HELONIX Water Pump Controller
 *  SCREEN.C — FINAL VERSION WITH SETTINGS (OPTION-B)
 *  PART A/6  — UPDATED MENU (Auto & Twist removed)
 ***************************************************************/

#include "screen.h"
#include "lcd_i2c.h"
#include "switches.h"
#include "model_handle.h"
#include "adc.h"
#include "rtc_i2c.h"
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <stdint.h>
#include "stm32f1xx_hal.h"

/* ================================================================
   UI ENUMS
   ================================================================ */

typedef enum {
    UI_WELCOME = 0,
    UI_DASH,
    UI_MENU,

    UI_MANUAL,
    UI_SEMI_AUTO,

    UI_TIMER,
    UI_TIMER_SLOT_SELECT,
    UI_TIMER_EDIT_SLOT_ON_H,
    UI_TIMER_EDIT_SLOT_ON_M,
    UI_TIMER_EDIT_SLOT_OFF_H,
    UI_TIMER_EDIT_SLOT_OFF_M,
    UI_TIMER_EDIT_SLOT_DAYS,
    UI_TIMER_EDIT_SLOT_ENABLE,

    /* Auto mode screens still exist but removed from menu access */
    UI_AUTO_MENU,
    UI_AUTO_EDIT_GAP,
    UI_AUTO_EDIT_MAXRUN,
    UI_AUTO_EDIT_RETRY,

    UI_COUNTDOWN,
    UI_COUNTDOWN_EDIT_MIN,

    /* Twist screens still exist but not accessible from menu */
    UI_TWIST,
    UI_TWIST_EDIT_ON,
    UI_TWIST_EDIT_OFF,
    UI_TWIST_EDIT_ON_H,
    UI_TWIST_EDIT_ON_M,
    UI_TWIST_EDIT_OFF_H,
    UI_TWIST_EDIT_OFF_M,

	UI_NONE,

    /* NEW: SETTINGS LINEAR FLOW (Option-B) */
    UI_SETTINGS_GAP,
    UI_SETTINGS_RETRY,
    UI_SETTINGS_UV,
    UI_SETTINGS_OV,
    UI_SETTINGS_OL,
    UI_SETTINGS_UL,
    UI_SETTINGS_MAXRUN,
    UI_SETTINGS_FACTORY,

    UI_MAX_
} UiState;

typedef enum {
    BTN_NONE = 0,
    BTN_RESET,
    BTN_SELECT,
    BTN_UP,
    BTN_DOWN,

    BTN_RESET_LONG,
    BTN_SELECT_LONG,
    BTN_UP_LONG,
    BTN_DOWN_LONG
} UiButton;

/* ================================================================
   GLOBAL UI VARIABLES
   ================================================================ */

static UiState ui = UI_WELCOME;
static UiState last_ui = UI_MAX_;

static bool screenNeedsRefresh = false;
static bool cursorVisible = true;

static uint32_t lastCursorToggle = 0;
static uint32_t lastLcdUpdateTime = 0;
static uint32_t lastUserAction = 0;

static const uint32_t WELCOME_MS      = 2500;
static const uint32_t CURSOR_BLINK_MS = 400;
static const uint32_t AUTO_BACK_MS    = 60000;

#define LONG_PRESS_MS         3000
#define CONTINUOUS_STEP_MS     300
#define COUNTDOWN_INC_MS      3000

/* Button timers */
static uint32_t sw_press_start[4] = {0,0,0,0};
static bool     sw_long_issued[4] = {false,false,false,false};

static uint32_t last_repeat_time = 0;

/* ================================================================
   EXTERNAL STATES
   ================================================================ */

extern ADC_Data adcData;
extern TimerSlot timerSlots[5];
extern TwistSettings twistSettings;

extern volatile bool manualActive;
extern volatile bool semiAutoActive;
extern volatile bool timerActive;
extern volatile bool countdownActive;
extern volatile bool twistActive;
extern volatile bool autoActive;
extern volatile uint32_t countdownDuration;

/* ================================================================
   TEMP EDIT VARIABLES
   ================================================================ */

static uint8_t  edit_timer_on_h  = 0,  edit_timer_on_m  = 0;
static uint8_t  edit_timer_off_h = 0, edit_timer_off_m = 0;
static uint8_t  edit_timer_dayMask   = 0x7F;
static uint8_t  edit_timer_dayIndex  = 0;
static bool     edit_timer_enabled   = true;

static uint16_t edit_auto_gap_s      = 60;
static uint16_t edit_auto_maxrun_min = 120;
static uint16_t edit_auto_retry      = 0;

static uint16_t edit_twist_on_s  = 5;
static uint16_t edit_twist_off_s = 5;

static uint8_t edit_twist_on_hh  = 6;
static uint8_t edit_twist_on_mm  = 0;
static uint8_t edit_twist_off_hh = 18;
static uint8_t edit_twist_off_mm = 0;

static uint16_t edit_countdown_min = 1;

static uint8_t currentSlot = 0;

/* ================================================================
   NEW SETTINGS TEMP VARIABLES (Option-B)
   ================================================================ */

static uint16_t edit_settings_gap_s = 10;
static uint8_t  edit_settings_retry = 3;

static uint16_t edit_settings_uv = 180;
static uint16_t edit_settings_ov = 260;

static float edit_settings_ol = 6.5f;
static float edit_settings_ul = 0.5f;

static uint16_t edit_settings_maxrun = 120;
static bool     edit_settings_factory_yes = false;

/* ================================================================
   MENU ITEMS (UPDATED — Auto & Twist removed)
   ================================================================ */

static const char* const main_menu[] = {
    "Timer Mode",
    "Settings",
    "Back"
};

#define MAIN_MENU_COUNT (sizeof(main_menu)/sizeof(main_menu[0]))

static int menu_idx = 0;
static int menu_view_top = 0;

/* ================================================================
   LCD HELPERS
   ================================================================ */

static inline void refreshInactivityTimer(void) {
    lastUserAction = HAL_GetTick();
}

static inline void lcd_line(uint8_t row, const char* s) {
    char buf[17];
    snprintf(buf, sizeof(buf), "%-16.16s", s);
    lcd_put_cur(row, 0);
    lcd_send_string(buf);
}

static inline void lcd_line0(const char* s){ lcd_line(0, s); }
static inline void lcd_line1(const char* s){ lcd_line(1, s); }

/* ================================================================
   MENU CURSOR (unchanged)
   ================================================================ */

static void draw_menu_cursor(void)
{
    if (ui != UI_MENU) return;

    uint8_t row = 255;

    if (menu_idx == menu_view_top)
        row = 0;
    else if (menu_idx == menu_view_top + 1)
        row = 1;

    if (row > 1) return;

    lcd_put_cur(row, 0);
    lcd_send_data(cursorVisible ? '>' : ' ');
}

/* ================================================================
   WELCOME SCREEN
   ================================================================ */

