Amiya200/stm32_water_tank/Core/Src/screen.c
static void show_welcome(void)
{
    lcd_clear();
    lcd_line0("   HELONIX");
    lcd_line1(" IntelligentSys");
}

/* ================================================================
   DASHBOARD
   ================================================================ */
void Screen_Init(void)
{
    lcd_init();
    lcd_clear();
    ui = UI_WELCOME;
    last_ui = UI_NONE;
    lastLcdUpdateTime = HAL_GetTick();
}

static void show_dash(void)
{
    char l0[17], l1[17];

    const char* motor = Motor_GetStatus() ? "ON " : "OFF";

    const char* mode = "IDLE";
    if (manualActive)          mode = "MANUAL";
    else if (semiAutoActive)   mode = "SEMI";
    else if (timerActive)      mode = "TIMER";
    else if (countdownActive)  mode = "CD";
    else if (twistActive)      mode = "TWIST";
    else if (autoActive)       mode = "AUTO";

    snprintf(l0, sizeof(l0), "M:%s %s", motor, mode);

    int submerged = 0;
    for (int i = 1; i <= 5; i++){
        if (adcData.voltages[i] < 0.1f)
            submerged++;
    }

    const char* level =
        (submerged>=5)?"100%":
        (submerged==4)?"80%":
        (submerged==3)?"60%":
        (submerged==2)?"40%":
        (submerged==1)?"20%":"0%";

    snprintf(l1, sizeof(l1), "Water:%s", level);

    lcd_line0(l0);
    lcd_line1(l1);
}

/* ================================================================
   MAIN MENU — UPDATED
   ================================================================ */

static void show_menu(void)
{
    char l0[17], l1[17];

    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > (menu_view_top + 1))
        menu_view_top = menu_idx - 1;

    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);
    snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);

    lcd_line0(l0);
    lcd_line1(l1);

    draw_menu_cursor();
}
/***************************************************************
 *  SCREEN.C — PART B / 6
 *  TIMER / AUTO / TWIST / COUNTDOWN / SETTINGS UI
 ***************************************************************/

/* ================================================================
   LCD VALUE FORMATTER
   ================================================================ */
static inline void lcd_val_next_int(uint16_t v){
    char buf[17];
    snprintf(buf, sizeof(buf), "val:%03u   Next>", v);
    lcd_line1(buf);
}

static inline void lcd_val_next_float(float v){
    char buf[17];
    snprintf(buf, sizeof(buf), "val:%0.1f   Next>", v);
    lcd_line1(buf);
}

/* ================================================================
   MANUAL MODE UI
   ================================================================ */

static void show_manual(void){
    lcd_line0("Manual Mode");
    lcd_line1(Motor_GetStatus() ? "val:STOP   Next>"
                                : "val:START  Next>");
}

/* ================================================================
   TIMER MODE — SLOT SELECT (5 slots)
   ================================================================ */

static int timer_page = 0;  // 0,1,2 → scrolling pages

static void show_timer_slot_select(void)
{
    lcd_clear();
    char l0[17] = {0};
    char l1[17] = {0};

    if (timer_page == 0)      // S1, S2
    {
        snprintf(l0, sizeof(l0),
                 "%cS1   %cS2",
                 (currentSlot == 0 ? '>' : ' '),
                 (currentSlot == 1 ? '>' : ' '));

        snprintf(l1, sizeof(l1),
                 "%cS3   %cS4",
                 (currentSlot == 2 ? '>' : ' '),
                 (currentSlot == 3 ? '>' : ' '));
    }
    else if (timer_page == 1) // S3, S4, S5, Back
    {
        snprintf(l0, sizeof(l0),
                 "%cS3   %cS4",
                 (currentSlot == 2 ? '>' : ' '),
                 (currentSlot == 3 ? '>' : ' '));

        snprintf(l1, sizeof(l1),
                 "%cS5   %cBack",
                 (currentSlot == 4 ? '>' :
                  currentSlot == 5 ? '>' : ' '),
                 (currentSlot == 5 ? '>' : ' '));
    }
    else                      // timer_page == 2 → S5 + Back
    {
        snprintf(l0, sizeof(l0),
                 "%cS5",
                 (currentSlot == 4 ? '>' : ' '));

        snprintf(l1, sizeof(l1),
                 "%cBack",
                 (currentSlot == 5 ? '>' : ' '));
    }

    lcd_line0(l0);
    lcd_line1(l1);
}

static void show_timer(void){
    TimerSlot *t = &timerSlots[currentSlot];

    char l0[17];
    snprintf(l0,sizeof(l0),
             "Slot %d %02d:%02d-%02d:%02d",
             currentSlot+1,
             t->onHour, t->onMinute,
             t->offHour, t->offMinute);

    lcd_line0(l0);
    lcd_line1("val:Edit   Next>");
}

static void show_timer_on_h(void){
    lcd_line0("TIMER ON HOUR");
    lcd_val_next_int(edit_timer_on_h);
}

static void show_timer_on_m(void){
    lcd_line0("TIMER ON MIN");
    lcd_val_next_int(edit_timer_on_m);
}

static void show_timer_off_h(void){
    lcd_line0("TIMER OFF HR");
    lcd_val_next_int(edit_timer_off_h);
}

static void show_timer_off_m(void){
    lcd_line0("TIMER OFF MIN");
    lcd_val_next_int(edit_timer_off_m);
}

/* Timer days: M T W T F S S */
static void show_timer_days(void){
    char pattern[8];
    const char names[7] = {'M','T','W','T','F','S','S'};
    for (int i = 0; i < 7; i++){
        pattern[i] = (edit_timer_dayMask & (1u << i)) ? names[i] : '-';
    }
    pattern[7] = '\0';

    char l0[17];
    snprintf(l0, sizeof(l0), "Days:%-7s", pattern);
    lcd_line0(l0);
    lcd_line1("U:Next D:Toggle");
}

static void show_timer_enable(void){
    lcd_line0("SLOT ENABLE?");
    lcd_line1(edit_timer_enabled ? "val:YES   Next>" : "val:NO    Next>");
}

/* ================================================================
   AUTO MODE SETTINGS (still available internally)
   ================================================================ */

static void show_auto_menu(void){
    lcd_line0("Auto Settings");
    lcd_line1(">Gap/Max/Retry");
}

static void show_auto_gap(void){
    lcd_line0("DRY GAP (s)");
    lcd_val_next_int(edit_auto_gap_s);
}

