Amiya200/stm32_water_tank/Core/Src/screen.c
        case UI_SETTINGS_UV:
            ui = UI_SETTINGS_OV;
            break;

        case UI_SETTINGS_OV:
            ui = UI_SETTINGS_OL;
            break;

        case UI_SETTINGS_OL:
            ui = UI_SETTINGS_UL;
            break;

        case UI_SETTINGS_UL:
            ui = UI_SETTINGS_MAXRUN;
            break;

        case UI_SETTINGS_MAXRUN:
            ui = UI_SETTINGS_FACTORY;
            break;

        case UI_SETTINGS_FACTORY:
            apply_settings_all();
            ui = UI_DASH;
            break;

        default:
            ui = UI_DASH;
            break;
    }

    screenNeedsRefresh = true;
}

/* ================================================================
   MENU SELECT HANDLER — UPDATED (Auto & Twist removed)
   ================================================================ */

static void goto_menu_top(void){
    menu_idx = 0;
    menu_view_top = 0;
}

static void menu_select(void){
    refreshInactivityTimer();

    /* ----------- WELCOME → DASH ----------- */
    if (ui == UI_WELCOME){
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    /* ----------- DASH → MENU ----------- */
    if (ui == UI_DASH){
        ui = UI_MENU;
        goto_menu_top();
        screenNeedsRefresh = true;
        return;
    }

    /* ============================
       UPDATED MAIN MENU (3 items)
       0 → Timer
       1 → Settings
       2 → Back
       ============================ */
    if (ui == UI_MENU){
        switch(menu_idx)
        {
            case 0: // TIMER
                ui = UI_TIMER_SLOT_SELECT;
                timer_page = 0;
                currentSlot = 0;
                break;

            case 1: // SETTINGS
                start_settings_edit_flow();
                return;

            case 2: // BACK
                ui = UI_DASH;
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       ---------------- TIMER FLOW ----------------
       ============================================================ */

    if (ui == UI_TIMER_SLOT_SELECT){
        if (currentSlot == 5){     // BACK
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;
        }

        /* Load slot values into editors */
        edit_timer_on_h   = timerSlots[currentSlot].onHour;
        edit_timer_on_m   = timerSlots[currentSlot].onMinute;
        edit_timer_off_h  = timerSlots[currentSlot].offHour;
        edit_timer_off_m  = timerSlots[currentSlot].offMinute;
        edit_timer_dayMask= timerSlots[currentSlot].dayMask;
        edit_timer_enabled= timerSlots[currentSlot].enabled;
        edit_timer_dayIndex = 0;

        ui = UI_TIMER_EDIT_SLOT_ON_H;
        screenNeedsRefresh = true;
        return;
    }

    /* TIMER EDITING CHAIN */
    switch(ui)
    {
        case UI_TIMER_EDIT_SLOT_ON_H:
            ui = UI_TIMER_EDIT_SLOT_ON_M;
            break;

        case UI_TIMER_EDIT_SLOT_ON_M:
            ui = UI_TIMER_EDIT_SLOT_OFF_H;
            break;

        case UI_TIMER_EDIT_SLOT_OFF_H:
            ui = UI_TIMER_EDIT_SLOT_OFF_M;
            break;

        case UI_TIMER_EDIT_SLOT_OFF_M:
            ui = UI_TIMER_EDIT_SLOT_DAYS;
            break;

        case UI_TIMER_EDIT_SLOT_DAYS:
            ui = UI_TIMER_EDIT_SLOT_ENABLE;
            break;

        case UI_TIMER_EDIT_SLOT_ENABLE:
            apply_timer_settings();
            ui = UI_TIMER_SLOT_SELECT;
            break;

        default:
            break;
    }

    /* ============================================================
       AUTO MODE FLOW (unchanged internally)
       ============================================================ */

    if (ui == UI_AUTO_MENU) {
        autoActive = false;
        ModelHandle_StopAuto();
        ui = UI_AUTO_EDIT_GAP;
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_AUTO_EDIT_GAP){
        ui = UI_AUTO_EDIT_MAXRUN;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_AUTO_EDIT_MAXRUN){
        ui = UI_AUTO_EDIT_RETRY;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_AUTO_EDIT_RETRY){
        apply_auto_settings();
        ui = UI_AUTO_MENU;
        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       TWIST FLOW (unchanged internally)
       ============================================================ */

    if (ui == UI_TWIST){
        ui = UI_TWIST_EDIT_ON;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_ON){
        ui = UI_TWIST_EDIT_OFF;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_OFF){
        ui = UI_TWIST_EDIT_ON_H;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_ON_H){
        ui = UI_TWIST_EDIT_ON_M;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_ON_M){
        ui = UI_TWIST_EDIT_OFF_H;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_OFF_H){
        ui = UI_TWIST_EDIT_OFF_M;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_OFF_M){
        apply_twist_settings();
        ui = UI_TWIST;
        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       COUNTDOWN FLOW
       ============================================================ */

    if (ui == UI_COUNTDOWN){
        if(countdownActive){
            ModelHandle_StopCountdown();
            ui = UI_DASH;
        } else {
            ui = UI_COUNTDOWN_EDIT_MIN;
        }
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_COUNTDOWN_EDIT_MIN){
        apply_countdown_settings();
        ui = UI_COUNTDOWN;
        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       SETTINGS LINEAR FLOW
       ============================================================ */

    if (ui >= UI_SETTINGS_GAP && ui <= UI_SETTINGS_FACTORY){
        advance_settings_flow();
        return;
    }
}
/***************************************************************
 *  SCREEN.C — PART D / 6
 *  BUTTON DECODER + EDIT ENGINE + MAIN SWITCH HANDLER
 ***************************************************************/

/* ================================================================
   BUTTON DECODER — Short/Long press detection
   ================================================================ */

static UiButton decode_button_press(void){
    bool sw1 = Switch_IsPressed(0);
    bool sw2 = Switch_IsPressed(1);
    bool sw3 = Switch_IsPressed(2);
    bool sw4 = Switch_IsPressed(3);

    bool sw[4] = {sw1, sw2, sw3, sw4};

    uint32_t now = HAL_GetTick();
    UiButton out = BTN_NONE;

    for (int i = 0; i < 4; i++)
    {
        if (sw[i] && sw_press_start[i] == 0) {
            sw_press_start[i] = now;
            sw_long_issued[i] = false;
        }
        else if (!sw[i] && sw_press_start[i] != 0){
            if (!sw_long_issued[i]){
                switch(i){
                    case 0: out = BTN_RESET; break;
                    case 1: out = BTN_SELECT; break;
                    case 2: out = BTN_UP; break;
                    case 3: out = BTN_DOWN; break;
                }
            }
            sw_press_start[i] = 0;
            sw_long_issued[i] = false;
        }
        else if (sw[i] && !sw_long_issued[i]){
            if (now - sw_press_start[i] >= LONG_PRESS_MS){
                sw_long_issued[i] = true;
                switch(i){
                    case 0: out = BTN_RESET_LONG; break;
                    case 1: out = BTN_SELECT_LONG; break;
                    case 2: out = BTN_UP_LONG; break;
                    case 3: out = BTN_DOWN_LONG; break;
                }
            }
        }
    }

    return out;
}

/* ================================================================
   EDIT ENGINE (Increase / Decrease)
   ================================================================ */

void increase_edit_value(void){
    switch(ui)
    {
        /* TIMER EDITING */
        case UI_TIMER_EDIT_SLOT_ON_H:  if(edit_timer_on_h < 23) edit_timer_on_h++; break;
        case UI_TIMER_EDIT_SLOT_ON_M:  if(edit_timer_on_m < 59) edit_timer_on_m++; break;
        case UI_TIMER_EDIT_SLOT_OFF_H: if(edit_timer_off_h < 23) edit_timer_off_h++; break;
        case UI_TIMER_EDIT_SLOT_OFF_M: if(edit_timer_off_m < 59) edit_timer_off_m++; break;

        /* AUTO (internal only — menu removed) */
        case UI_AUTO_EDIT_GAP:         edit_auto_gap_s++; break;
        case UI_AUTO_EDIT_MAXRUN:      edit_auto_maxrun_min++; break;
        case UI_AUTO_EDIT_RETRY:       edit_auto_retry++; break;

        /* TWIST (internal only — menu removed) */
        case UI_TWIST_EDIT_ON:         edit_twist_on_s++; break;
        case UI_TWIST_EDIT_OFF:        edit_twist_off_s++; break;
        case UI_TWIST_EDIT_ON_H:       if(edit_twist_on_hh < 23) edit_twist_on_hh++; break;
        case UI_TWIST_EDIT_ON_M:       if(edit_twist_on_mm < 59) edit_twist_on_mm++; break;
        case UI_TWIST_EDIT_OFF_H:      if(edit_twist_off_hh < 23) edit_twist_off_hh++; break;
        case UI_TWIST_EDIT_OFF_M:      if(edit_twist_off_mm < 59) edit_twist_off_mm++; break;

        /* COUNTDOWN */
        case UI_COUNTDOWN_EDIT_MIN:    if(edit_countdown_min < 999) edit_countdown_min++; break;

        /* SETTINGS FLOW (Option-B) */
        case UI_SETTINGS_GAP:          edit_settings_gap_s++; break;
        case UI_SETTINGS_RETRY:        edit_settings_retry++; break;
        case UI_SETTINGS_UV:           if(edit_settings_uv < 500) edit_settings_uv++; break;
        case UI_SETTINGS_OV:           if(edit_settings_ov < 500) edit_settings_ov++; break;
        case UI_SETTINGS_OL:
            edit_settings_ol += 0.1f;
            if(edit_settings_ol > 50.0f) edit_settings_ol = 50.0f;
            break;

        case UI_SETTINGS_UL:
            edit_settings_ul += 0.1f;
            if(edit_settings_ul > 50.0f) edit_settings_ul = 50.0f;
            break;

