Amiya200/stm32_water_tank/Core/Src/screen.c
            case BTN_DOWN:      decrease_edit_value(); break;
            case BTN_DOWN_LONG: last_repeat_time = now; decrease_edit_value(); break;

            case BTN_SELECT:    menu_select(); break;

            case BTN_RESET:     ui = UI_MENU; break;

            default: break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       MENU NAVIGATION (UPDATED MENU SIZE)
       ============================================================ */

    if (menu_open && ui == UI_MENU){
        switch(b){
            case BTN_UP:
                if(menu_idx > 0) menu_idx--;
                break;

            case BTN_DOWN:
                if(menu_idx < MAIN_MENU_COUNT-1) menu_idx++;
                break;

            case BTN_SELECT:
                menu_select();
                break;

            case BTN_RESET:
                ui = UI_DASH;
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       TIMER SLOT SELECT NAVIGATION
       ============================================================ */

    if (menu_open && ui == UI_TIMER_SLOT_SELECT){
        switch(b){
            case BTN_UP:
                if (currentSlot > 0) currentSlot--;
                timer_page = (currentSlot < 2 ? 0 :
                             (currentSlot < 5 ? 1 : 2));
                break;

            case BTN_DOWN:
                if (currentSlot < 5) currentSlot++;
                timer_page = (currentSlot < 2 ? 0 :
                             (currentSlot < 5 ? 1 : 2));
                break;

            case BTN_SELECT:
                menu_select();
                break;

            case BTN_RESET:
                ui = UI_MENU;
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       DAYS EDIT MODE
       ============================================================ */

    if (menu_open && ui == UI_TIMER_EDIT_SLOT_DAYS){
        switch(b){
            case BTN_UP:
            case BTN_UP_LONG:
                edit_timer_dayIndex = (edit_timer_dayIndex + 1) % 7;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                edit_timer_dayMask ^= (1u << edit_timer_dayIndex);
                break;

            case BTN_SELECT:
                menu_select();
                break;

            case BTN_RESET:
                ui = UI_TIMER_SLOT_SELECT;
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       SLOT ENABLE / DISABLE
       ============================================================ */

    if (menu_open && ui == UI_TIMER_EDIT_SLOT_ENABLE){
        switch(b){
            case BTN_UP:
            case BTN_DOWN:
            case BTN_UP_LONG:
            case BTN_DOWN_LONG:
                edit_timer_enabled = !edit_timer_enabled;
                break;

            case BTN_SELECT:
                apply_timer_settings();
                ui = UI_TIMER_SLOT_SELECT;
                break;

            case BTN_RESET:
                ui = UI_TIMER_SLOT_SELECT;
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       SETTINGS FLOW (Option-B)
       ============================================================ */

    if (menu_open && (ui >= UI_SETTINGS_GAP && ui <= UI_SETTINGS_FACTORY))
    {
        switch(b){
            case BTN_UP:        increase_edit_value(); break;
            case BTN_DOWN:      decrease_edit_value(); break;
            case BTN_UP_LONG:   last_repeat_time = now; increase_edit_value(); break;
            case BTN_DOWN_LONG: last_repeat_time = now; decrease_edit_value(); break;

            case BTN_SELECT:    advance_settings_flow(); break;
            case BTN_RESET:     ui = UI_MENU; break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       AUTO MODE BLOCK (unchanged)
       ============================================================ */

    if (ui == UI_AUTO_MENU ||
        ui == UI_AUTO_EDIT_GAP ||
        ui == UI_AUTO_EDIT_MAXRUN ||
        ui == UI_AUTO_EDIT_RETRY)
    {
        if (b == BTN_SELECT){
            menu_select();
            screenNeedsRefresh = true;
        }
        else if (b == BTN_RESET){
            ui = UI_MENU;
            screenNeedsRefresh = true;
        }
        return;
    }

    /* ============================================================
       DASHBOARD BUTTON BEHAVIOR (DEFAULT)
       ============================================================ */

    switch(b)
    {
        case BTN_RESET:
            reset();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_RESET_LONG:
            ModelHandle_ToggleManual();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* START/STOP AUTO ONLY FROM DASH */
        case BTN_SELECT:
            if (ui != UI_DASH)
                return;

            if(!autoActive)
                ModelHandle_StartAuto(edit_auto_gap_s, edit_auto_maxrun_min, edit_auto_retry);
            else
                ModelHandle_StopAuto();

            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* LONG SELECT → MENU */
        case BTN_SELECT_LONG:
            ui = UI_MENU;
            goto_menu_top();
            screenNeedsRefresh = true;
            return;

        /* UP → Timer ON/OFF */
        case BTN_UP:
            if(!timerActive)
                ModelHandle_StartTimerNearestSlot();
            else
                ModelHandle_StopTimer();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* UP LONG → Semi-Auto toggle */
        case BTN_UP_LONG:
            if(!semiAutoActive)
                ModelHandle_StartSemiAuto();
            else
                ModelHandle_StopSemiAuto();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* DOWN → Countdown */
        case BTN_DOWN:
            if(!countdownActive){
                ModelHandle_StartCountdown(edit_countdown_min * 60);
                ui = UI_COUNTDOWN;
            } else {
                ModelHandle_StopCountdown();
                ui = UI_DASH;
            }
            screenNeedsRefresh = true;
            return;

